<?xml version="1.0" encoding="utf-8"?>
<rss version="2.0"><channel><title>lobstre.rs rss with inlined content</title><link>http://n-gate.com</link><description>webshit condom</description><lastBuildDate>Thu, 15 Apr 2021 16:56:01 -0500</lastBuildDate><item><title>The Sisyphean Task Of DNS Client Config on Linux</title><link>https://lobste.rs/s/v9w4ax</link><description>&lt;p dir="ltr"&gt;DNS (Domain Name Service) was invented in 1983. DNS is a system that lets you
turn names into IP addresses so that your computer can know how to connect with
websites like tailscale.com. This is a simple service, so the authors of 4.3 BSD
specified a simple configuration file called &lt;code dir="ltr"&gt;/etc/resolv.conf&lt;/code&gt;:&lt;/p&gt;&lt;PRE&gt;&lt;code data-lang="console"&gt;$ cat /etc/resolv.conf
nameserver 192.168.122.1
&lt;/code&gt;&lt;/PRE&gt;&lt;p&gt;In this case, it tells the DNS resolution function to use 192.168.122.1 as the
DNS server. This means that when you do lookups for websites like tailscale.com,
it will ask 192.168.122.1 to do that lookup for you:&lt;/p&gt;&lt;PRE&gt;&lt;code data-lang="console"&gt;$ nslookup tailscale.com
Server:                192.168.122.1
Address:        192.168.122.1:53

Non-authoritative answer:
Name:        tailscale.com
Address: 18.205.143.78
&lt;/code&gt;&lt;/PRE&gt;&lt;p&gt;If Tailscale were around in the old days, we could probably just modify

&lt;/code&gt;&lt;/PRE&gt;&lt;p&gt;We can even observe the fragmented packets in Wireshark which is also pretty cool:&lt;/p&gt;&lt;img alt="wireshark" src="https://doar-e.github.io/images/reverse_engineering_tcpip/ws0.png" width="405" height="87"&gt;&lt;p dir="ltr"&gt;For those that are not familiar with packet fragmentation, it is a mechanism used to chop large packets (larger than the &lt;a href="https://en.wikipedia.org/wiki/Maximum_transmission_unit" dir="ltr"&gt;Maximum Transmission Unit&lt;/a&gt;) in smaller chunks to be able to be sent across network equipment. The receiving network stack has the burden to stitch them all together in a safe manner (winkwink).&lt;/p&gt;&lt;p&gt;All right, perfect. We have now what I consider a good enough research environment and we can start digging deep into the code. At this point, let's not focus on the vulnerability yet but instead try to understand how the code works, the type of arguments it receives, recover structures and the semantics of important fields, etc. Let's get our HexRays decompilation output pretty.&lt;/p&gt;&lt;p&gt;As you might imagine, this is the part that's the most time consuming. I use a mixture of bottom-up, top-down. Loads of experiments. Commenting the decompiled code as best as I can, challenging myself by asking questions, answering them, rinse &amp;amp; repeat.&lt;/p&gt;&lt;h2&gt;High level overview&lt;/h2&gt;&lt;p dir="ltr"&gt;Oftentimes, studying code / features in isolation in complex systems is not enough; it only takes you so far. Complex drivers like &lt;code dir="ltr"&gt;tcpip.sys&lt;/code&gt; are gigantic, carry a lot of state, and are hard to reason about, both in terms of execution and data flow. In this case, there is this sort of size integer, that seems to be related to something that got received and we want to set that to 0xffff. Unfortunately, just focusing on &lt;code dir="ltr"&gt;Ipv6pReassembleDatagram&lt;/code&gt; and &lt;code dir="ltr"&gt;Ipv6pReceiveFragment&lt;/code&gt; was not enough for me to make significant progress. It was worth a try though but time to switch gears.&lt;/p&gt;&lt;h3&gt;Zooming out&lt;/h3&gt;&lt;p dir="ltr"&gt;All right, that's cool, our HexRays decompiled code is getting prettier and prettier; it feels rewarding. We have abused the &lt;em dir="ltr"&gt;create new structure&lt;/em&gt; feature to lift a bunch of structures. We guessed about the semantics of some of them but most are still unknown. So yeah, let's work smarter.&lt;/p&gt;&lt;p dir="ltr"&gt;We know that &lt;code dir="ltr"&gt;tcpip.sys&lt;/code&gt; receives packets from the network; we don't know exactly how or where from but maybe we don't need to know that much. One of the first questions you might ask yourself is how the kernel stores network data? What structures does it use?&lt;/p&gt;&lt;h4&gt;NET_BUFFER &amp;amp; NET_BUFFER_LIST&lt;/h4&gt;&lt;p dir="ltr"&gt;If you have some Windows kernel experience, you might be familiar with &lt;a href="https://en.wikipedia.org/wiki/Network_Driver_Interface_Specification" dir="ltr"&gt;NDIS&lt;/a&gt; and you might also have heard about some of the APIs and the structures it exposes to users. It is documented because third-parties can develop extensions and drivers to interact with the network stack at various points.&lt;/p&gt;&lt;p dir="ltr"&gt;An important structure in this world is &lt;code dir="ltr"&gt;NET_BUFFER&lt;/code&gt;. This is what it looks like in WinDbg:&lt;/p&gt;&lt;PRE&gt;&lt;code&gt;kd&amp;gt; dt NDIS!_NET_BUFFER
NDIS!_NET_BUFFER
   +0x000 Next             : Ptr64 _NET_BUFFER
   +0x008 CurrentMdl       : Ptr64 _MDL
   +0x010 CurrentMdlOffset : Uint4B
   +0x018 DataLength       : Uint4B
   +0x018 stDataLength     : Uint8B
   +0x020 MdlChain         : Ptr64 _MDL
   +0x028 DataOffset       : Uint4B
   +0x000 Link             : _SLIST_HEADER
   +0x000 NetBufferHeader  : _NET_BUFFER_HEADER
   +0x030 ChecksumBias     : Uint2B
   +0x032 Reserved         : Uint2B
   +0x038 NdisPoolHandle   : Ptr64 Void
   +0x040 NdisReserved     : [2] Ptr64 Void
   +0x050 ProtocolReserved : [6] Ptr64 Void
   +0x080 MiniportReserved : [4] Ptr64 Void
   +0x0a0 DataPhysicalAddress : _LARGE_INTEGER
   +0x0a8 SharedMemoryInfo : Ptr64 _NET_BUFFER_SHARED_MEMORY
   +0x0a8 ScatterGatherList : Ptr64 _SCATTER_GATHER_LIST
&lt;/code&gt;&lt;/PRE&gt;&lt;p dir="ltr"&gt;It can look overwhelming but we don't need to understand every detail. What is important is that the network data are stored in a regular &lt;a href="https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/using-mdls" dir="ltr"&gt;MDL&lt;/a&gt;. As MDLs, &lt;em dir="ltr"&gt;NET_BUFFER&lt;/em&gt; can be chained together which allows the kernel to store a large amount of data in a bunch of non-contiguous chunks of physical memory; virtual memory is the magic wand used to make the data look contiguous. For the readers that are not familiar with Windows kernel development, an MDL is a Windows kernel construct that allows users to map physical memory in a contiguous virtual memory region. Every MDL is actually followed by a list of &lt;code dir="ltr"&gt;PFNs&lt;/code&gt; (which don't need to be contiguous) that the Windows kernel is able to map in a contiguous virtual memory region; magic.&lt;/p&gt;&lt;PRE&gt;&lt;code&gt;kd&amp;gt; dt nt!_MDL
   +0x000 Next             : Ptr64 _MDL
   +0x008 Size             : Int2B
   +0x00a MdlFlags         : Int2B
   +0x00c AllocationProcessorNumber : Uint2B
   +0x00e Reserved         : Uint2B
   +0x010 Process          : Ptr64 _EPROCESS
   +0x018 MappedSystemVa   : Ptr64 Void
   +0x020 StartVa          : Ptr64 Void
   +0x028 ByteCount        : Uint4B
   +0x02c ByteOffset       : Uint4B
&lt;/code&gt;&lt;/PRE&gt;&lt;p dir="ltr"&gt;&lt;code dir="ltr"&gt;NET_BUFFER_LIST&lt;/code&gt; are basically a structure to keep track of a list of &lt;code dir="ltr"&gt;NET_BUFFERs&lt;/code&gt; as the name suggests:&lt;/p&gt;&lt;PRE&gt;&lt;code&gt;kd&amp;gt; dt NDIS!_NET_BUFFER_LIST
   +0x000 Next             : Ptr64 _NET_BUFFER_LIST
   +0x008 FirstNetBuffer   : Ptr64 _NET_BUFFER
   +0x000 Link             : _SLIST_HEADER
   +0x000 NetBufferListHeader : _NET_BUFFER_LIST_HEADER
   +0x010 Context          : Ptr64 _NET_BUFFER_LIST_CONTEXT
   +0x018 ParentNetBufferList : Ptr64 _NET_BUFFER_LIST
   +0x020 NdisPoolHandle   : Ptr64 Void
   +0x030 NdisReserved     : [2] Ptr64 Void
   +0x040 ProtocolReserved : [4] Ptr64 Void
   +0x060 MiniportReserved : [2] Ptr64 Void
   +0x070 Scratch          : Ptr64 Void
   +0x078 SourceHandle     : Ptr64 Void
   +0x080 NblFlags         : Uint4B
   +0x084 ChildRefCount    : Int4B
   +0x088 Flags            : Uint4B
   +0x08c Status           : Int4B
   +0x08c NdisReserved2    : Uint4B
   +0x090 NetBufferListInfo : [29] Ptr64 Void
